In [ ]:
## \#06: Mengganti nama (label) kolom pada Data Frame

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  2  2  7  5  8
1  8  2  3  2  8
2  3  6  8  5  1
3  3  9  3  3  1
4  7  5  8  1  3

In [ ]:
### Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [6]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  2  2     7  5  8
1  8  2     3  2  8
2  3  6     8  5  1
3  3  9     3  3  1
4  7  5     8  1  3

In [ ]:
### Mengganti nama (label) untuk banyak kolom pada Data Frame

In [8]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     2       2  7     5  8
1     8       2  3     2  8
2     3       6  8     5  1
3     3       9  3     3  1
4     7       5  8     1  3